// test4.0.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
#include"Queue.h"
#include <iostream>
using namespace std;

int main()
{
	Queue<string> object;
	while (true) {
		string element;
		cout << "Enter the string "; cin >> element;
		object.push(element);
		int flag;
		cout << "Enter the 0 if you want to continue "; cin >> flag;
		if (flag != 0)
			break;
	}
	cout << object;
}
/*
Створити шаблонний клас(колекцію) Черга для роботи з чергою.
Визначити у ньому декілька конструкторів(у тому числі конструктор за замовчуванням, який створює порожню чергу),
метод додавання елемента у чергу, метод виведення, можливо інші методи.
Для черги символів передбачити можливість циклічного зсуву її елементів на задану кількість позицій вправо
(за допомогою операції “ >> ”).Написати програму, що демонструє роботу з цим шаблоном для черг дійсних чисел і символів.
У програмі передбачити створення двох масивів об’єктів класу Черга(по одному кожного виду) і 
передачу кожного з них(масивів) у зовнішню функцію, яка виконує злиття цих об’єктів у єдину чергу.
Елементи отриманої черги символів циклічно зсунути на k позицій вправо(k - вводиться з клавіатури).
Програма повинна забезпечувати наочне виведення усіх вхідних
, вихідних та проміжних даних, а також контроль можливих помилок.
Для обробки помилок(у тому числі і не коректного введення даних) використати виключні ситуації.*/
// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
